In [1]:
import pandas as pd

In [2]:
phosphate = pd.read_excel('RICKY EXCEL.xlsx', sheet_name="Sheet1")

In [3]:
phosphate_t = phosphate.T
phosphate_t

             0     1     2     3
STATION      A     B     C     D
JUNE     0.045  0.74  2.03  1.65
JULY     0.012  0.46  1.94  1.03
AUGUST   0.018  0.34  1.78  1.08

In [5]:
phosphate_t = phosphate_t.rename(columns=phosphate_t.iloc[0])

In [8]:
phosphate_t = phosphate_t.drop(phosphate_t.index[0])

In [11]:
phosphate_t

            A     B     C     D
JUNE    0.045  0.74  2.03  1.65
JULY    0.012  0.46  1.94  1.03
AUGUST  0.018  0.34  1.78  1.08

In [12]:
phosphate_t.to_csv('phosphate_t.csv')

In [13]:
phosphate_t.corr(method ='pearson')

Empty DataFrame
Columns: []
Index: []

In [ ]:
df.corr(method ='pearson')

In [14]:
nitrates = pd.read_excel('RICKY EXCEL.xlsx', sheet_name="Sheet2")

In [15]:
nitrates_t = nitrates.T
nitrates_t

             0     1     2     3
STATION      A     B     C     D
JUNE     0.097  0.83  1.93  1.06
JULY     0.032  0.76  1.39  0.98
AUGUST   0.012  0.67  1.26  0.89

In [16]:
nitrates_t = nitrates_t.rename(columns=nitrates_t.iloc[0])

In [17]:
nitrates_t = nitrates_t.drop(nitrates_t.index[0])

In [18]:
nitrates_t

            A     B     C     D
JUNE    0.097  0.83  1.93  1.06
JULY    0.032  0.76  1.39  0.98
AUGUST  0.012  0.67  1.26  0.89

In [19]:
nitrates_t.to_csv('nitrates_t.csv')